modules/sitampan/controllers/KinHarianController.php

    public function actionTarget()
    {
        $sess = Yii::$app->session;
        $searchModel = new KinHarianSearch(['nip' => $sess['nip']]);
        $searchModel['tanggal'] = date('d');
        $searchModel['bulan'] = date('n');
        $searchModel['tahun'] = date('Y');

        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->orderBy(['tgl' => SORT_ASC, 'id' => SORT_ASC]);

        $atasan = KinAtasan::findOne($sess['nip']);
---
SELECT * FROM "kin_atasan" WHERE "nip"='197605262011012005'

    public function actionRealisasi()
    {
        $sess = Yii::$app->session;
        $searchModel = new KinHarianSearch(['nip' => $sess['nip']]);
        $searchModel['tanggal'] = date('d');
        $searchModel['bulan'] = date('n');
        $searchModel['tahun'] = date('Y');
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->orderBy(['tgl' => SORT_ASC, 'id' => SORT_ASC]);

        $atasan = KinAtasan::findOne($sess['nip']);
        if($atasan === null){
            $sess['nip_atasan'] = '';
            $sess['nama_atasan'] = '';
            $sess['tablok_atasan'] = '';
            $sess['tablokb_atasan'] = '';
        }else{
            $sess['nip_atasan'] = $atasan['nip_atasan'];
            $sess['nama_atasan'] = $atasan['nama_atasan'];
            $sess['tablok_atasan'] = $atasan['tablok_atasan'];
            $sess['tablokb_atasan'] = $atasan['tablokb_atasan'];
        }

        $batas = PreskinParam::findOne(1)['batas_pres'];
---
SELECT * FROM "kin_atasan" WHERE "nip"='197605262011012005'
SELECT * FROM "preskin_param" WHERE "id"=1

    public function actionCreate($tgl)
    {
        $sess = Yii::$app->session;
        $model = new KinHarian([
            'id' => $sess['nip'].'-'.time(),
            'tgl' => $tgl,
            'id_pns' => $sess['pengguna'],
            'nip' => $sess['nip'],
            'tablok' => $sess['tablok'],
            'tablokb' => $sess['tablokb'],
            'nama' => $sess['namapengguna'],
            'penilai_nip' => $sess['nip_atasan'],
            'penilai_tablok' => $sess['tablok_atasan'],
            'penilai_tablokb' => $sess['tablokb_atasan'],
            'penilai_nama' => $sess['nama_atasan'],
        ]);

        $output = KinJenisOutput::find()
        ->orderBy(['jenis_output'=>SORT_ASC])
        ->all();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM "kin_jenis_output" ORDER BY "jenis_output"
INSERT INTO "kin_harian" ("id", "tgl", "id_pns", "nip", "tablok", "tablokb", "nama", "penilai_nip", "penilai_tablok", "penilai_tablokb", "penilai_nama", "uraian_keg_h", "target_kuan_h", "target_output_h", "target_waktu_h", "tgl_target", "penilaian", "flag") VALUES ('197605262011012005-1732519938', '2024-11-18', 'A8ACA7BB85E83912E040640A040269BB', '197605262011012005', '31000000', '31000102', 'RATNA UMU UMAROH', '198104152008012021', '31000000', '31000102', 'HADI WIDYANINGRUM', 'Mengikuti Apel Pagi', 1, 'Kegiatan', 60, '2024-11-25 14:32:01', '', 0) RETURNING "id"

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $output = KinJenisOutput::find()
        ->orderBy(['jenis_output'=>SORT_ASC])
        ->all();
---
SELECT * FROM "kin_jenis_output" ORDER BY "jenis_output"

    public function actionUpdateRel($id)
    {
        $model = $this->findModel($id);
        $output = KinJenisOutput::find()
        ->orderBy(['jenis_output'=>SORT_ASC])
        ->all();
---
SELECT * FROM "kin_jenis_output" ORDER BY "jenis_output"

    protected function findModel($id)
    {
        if (($model = KinHarian::findOne($id)) !== null) {
---
SELECT * FROM "kin_harian" WHERE "id"='197101222010011002-1732244065'

    public function actionKinerjaBawahan($id)
    {
        $sess = Yii::$app->session;
        $searchModel = new KinHarianSearch(['nip' => $id, 'penilai_nip' => $sess['nip']]);
        //$searchModel['tanggal'] = date('d');
        $searchModel['bulan'] = date('n');
        $searchModel['tahun'] = date('Y');
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->orderBy(['tgl' => SORT_ASC, 'id' => SORT_ASC]);
        $modl = $dataProvider->query->one();

        if($modl === null){
            $mod = EpsMastfip::find()->select(['B_02', 'B_03'])->where(['B_02' => $id])->one();
            $modl['nama'] = $mod['B_03'];
        }

        $batas = PreskinParam::findOne(1)['batas_pres'];
---
SELECT * FROM "preskin_param" WHERE "id"=1

    public function actionUpdateNil($id)
    {
        $model = $this->findModel($id);
        $output = KinJenisOutput::find()
        ->orderBy(['jenis_output'=>SORT_ASC])
        ->all();
---
SELECT * FROM "kin_jenis_output" ORDER BY "jenis_output"